#+TITLE: M2R Parallel System Project - Fix Analysis
#+AUTHOR: Christopher FERREIRA

** Gather data

#+BEGIN_SRC sh
  export LANG=C

  datafile=time.csv
  rm -f $datafile

  for exp in ../first_run/outputs/* ../../first_analysis/first_run/outputs/* ../../first_analysis/second_run/outputs/*; do
      program=$(echo $(basename $exp) | cut -d'-' -f1)
      pinning=$(echo $(basename $exp) | cut -d'-' -f2)
      threads=$(echo $(basename $exp) | cut -d'-' -f3)

      for iteration_dir in $exp/*; do
          iteration=$(basename $iteration_dir)
          time=$(tail -1 $iteration_dir/time)

          printf '%s,%s,%d,%d,%f\n' \
                 $program $pinning $threads $iteration \
                 $time \
                 >>$datafile
      done
  done

  wc -l $datafile
#+END_SRC

#+RESULTS:
: 1700 time.csv

*** Setup

We first load the required libraries, loading the meta-package tidyverse
gets us everything (most notably dplyr and ggplot2).

#+BEGIN_SRC R :colnames no :results value verbatim
  library('tidyverse')

  'Ok !'
#+END_SRC

#+RESULTS:
: Ok !

Now we can load our data :
#+BEGIN_SRC R
  data <- read_csv('time.csv',
          col_names = c('Program', 'Pinning', 'Threads', 'Iteration', 'Time'))
  summary(data)
#+END_SRC

#+RESULTS:
| Program          | Pinning          | Threads       | Iteration     | Time          |
|------------------+------------------+---------------+---------------+---------------|
| Length:1700      | Length:1700      | Min.   : 8.00 | Min.   : 1.00 | Min.   : 0.89 |
| Class :character | Class :character | 1st Qu.:24.00 | 1st Qu.:10.00 | 1st Qu.: 5.30 |
| Mode  :character | Mode  :character | Median :40.00 | Median :19.00 | Median :10.80 |
| nil              | nil              | Mean   :36.99 | Mean   :20.21 | Mean   :14.41 |
| nil              | nil              | 3rd Qu.:56.00 | 3rd Qu.:28.00 | 3rd Qu.:20.77 |
| nil              | nil              | Max.   :64.00 | Max.   :50.00 | Max.   :62.68 |

